name: "gradability_model"
backend: "python"
max_batch_size: 128

input [
  {
    name: "raw_image"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1]
  }
]

output [
  {
    name: "output_0"
    data_type: TYPE_FP32	
    dims: [2]
  }
]

instance_group [
  {
    kind: KIND_CPU
  }
]